{
    "projects" : [
        {
            "image" : "images/projects/TCA.png",
            "title": "Toronto Crime Analysis",
            "bodyText": "- Build an interactive dashboard that displays charts, graphs and maps that examines different categories of crime for 158 neighborhoods in Toronto.\n - Capitalize available data and clean it using Python (Jupyter Notebook), load the data into a Database (PostgreSQL), connect to an API using Flask, and create different visualizations by leveraging leaflet.js, plotly.js, D3.js.  \n - Added Select2 JavaScript library that enhance the functionality of standard HTML select element and provides a user-friendly interface by selecting one or more options from a long list of items.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/AdamTuor/Project-3"
                }
            ],
            "tags" : [
                "Python",
                "PostgreSQL",
                "API",
                "Flask",
                "HTML"
            ]
        },
        {
            "image" : "images/projects/ETL.png",
            "title": "Crowdfunding ETL",
            "bodyText": "- Building an ETL pipeline using Pythons, Pandas and different Python libraries and regular expressions to extract and transform the data into CSV files and create ERD Diagram and table schema and uploaded CSV file data into a PostgreSQL. \n - Leveraged Pandas, NumPy, json libraries and created DataFrame by exporting and transforming excel data with different types of data frames.\n - Utilized ERD to sketch the diagram and table schema to load the data in Database.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Aparmar48/Crowdfunding_ETL"
                }
            ],
            "tags" : [
                "ETL Pipeline",
                "Python Dict",
                "pgAdmin 4",
                "PostgreSQL"
            ]
        },
        {
            "image" : "images/projects/NBA.png",
            "title": "NBA Players and Game Analysis",
            "bodyText": "- Aggregated three data sets, cleaned and merged data by using python libraries in Jupyter Notebook. \n - generated statistics summary for different players and analyse player performance with different visualization charts and graphs with the help of Matplotlib. \n - Utilized Scatter and Box plots, Charts (Bar, Line, and Pie), which helps to compare different game patterns performed by players with the help of linear regression, correlation, aggregation, summary statistics.",
            "links": [
                {
                    "text": "GitHub",
                    "href": "https://github.com/Aparmar48/Project_group_10"
                }
            ],
            "tags" : [
                "Pandas",
                "NumPy",
                "SciPy",
                "Matplotlib",
                "Seaborn"
            ]
        }
    ]
}